Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Multiple declarations are permitted and may execute for the same variable at different times.
ja: 複数の宣言を行うことができ、同じ変数に対して異なるタイミングで実行することができます。

source: Multiple dimensions.
ja: 多次元です。

source: Multiple hotkeys can be stacked vertically to have them perform the same action.
ja: 複数のホットキーを縦に重ねて、同じ動作をさせることができます。

source: Multiple hotkeys or hotstrings can be stacked together to call the same function.
ja: 複数のホットキーやホットストリングを重ねて、同じ機能を呼び出すことができます。

source: Multiple hotkeys, multiple hotstrings.
ja: 複数のホットキー、複数のホットストリング。

source: Multiple hotkeys/hotstrings per file
ja: ファイルごとに複数のホットキー/ホットストリング

source: Multiple lines are merged with the line above the section, which starts with ( and ends with ) (both symbols must appear at the beginning of a line, excluding whitespace).
ja: 複数の行は、セクションの上にある、(で始まり、)で終わる行にマージされます（両方の記号は、空白を除いて行頭に現れる必要があります）。

source: Multiple rows of tabs are displayed, if necessary, so all tabs are visible at once.
ja: 必要に応じてタブを複数行表示し、すべてのタブが一度に見えるようにする。

source: Multiple tabs can be selected by holding down Ctrl when clicking.
ja: Ctrlを押しながらクリックすると、複数のタブを選択できる。

source: Multiple variables may be declared on the same line by separating them with commas as in these examples:
ja: 以下の例のように、カンマで区切ることで複数の変数を同じ行で宣言することができます：

source: Must be either REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD, or REG_BINARY.
ja: REG_SZ、REG_EXPAND_SZ、REG_MULTI_SZ、REG_DWORD、またはREG_BINARYのいずれかでなければなりません。

source: Must be one of the following:
ja: 次のいずれかに該当すること：

source: Must be one of those listed below.
ja: 以下のいずれかに該当すること。

source: Mute the volume
ja: ミュート

source: Mute/unmute the master volume.
ja: マスターボリュームをミュート／アンミュートする。

source: Mutes Line In.
ja: ラインインをミュートにします。

source: Mutes microphone recording.
ja: マイク録音をミュートします。

source: My Documents
ja: マイドキュメント

source: My antivirus program flagged AHK as malware.
ja: 私のアンチウイルスプログラムはAHKをマルウェアとしてフラグを立てました。

source: My antivirus program flagged AutoHotkey or a compiled script as malware.
ja: アンチウイルスプログラムがAutoHotkeyやコンパイルされたスクリプトをマルウェアと判定しました。

source: My keypad has a special 000 key.
ja: 私のキーパッドには、特別な000キーがあります。

source: MyBtn.OnEvent("Click", MyBtn_Click) ; Call MyBtn_Click when clicked.
ja: MyBtn.OnEvent("Click", MyBtn_Click) ; クリックされたときにMyBtn_Clickをコールします。

source: MyFunc(X, Y:=2, Z:=0) { ; Note that Z must still be optional in this case.
ja: MyFunc(X, Y:=2, Z:=0) { ; この場合でも、Zはオプションでなければならないことに注意してください。

source: MyFunc(p?) { ; Equivalent to MyFunc(p := unset)
ja: MyFunc(p?) { ; MyFunc(p := unset) に相当します。

source: MyFunction(1, -1) ; err.Line indicates this line.
ja: MyFunction(1, -1) ; err.Lineはこの行を示します。

source: MyGlobal := 33 ; Assigns 33 to a global variable, first creating the variable if necessary.
ja: MyGlobal := 33 ; グローバル変数に33を代入します。必要であれば、まず変数を作成します。

source: MyGui := Gui("+Resize") ; Allow the user to maximize or drag-resize the window.
ja: MyGui := Gui("+Resize") ; ウィンドウの最大化、ドラッグリサイズができるようにする。

source: MyGui := Gui("+Resize", "Untitled") ; Make the window resizable.
ja: MyGui := Gui("+Resize", "Untitled") ; ウィンドウをリサイズ可能にします。

source: MyGui := Gui("+Resize", TreeRoot) ; Allow the user to maximize or drag-resize the window.
ja: MyGui := Gui("+Resize", TreeRoot) ; ウィンドウの最大化、ドラッグリサイズができるようにする。

source: MyGui := Gui() ; Create a MyGui window.
ja: MyGui := Gui() ; MyGuiのウィンドウを作成します。

source: MyGui.Add("Custom", "ClassComboBoxEx32") ; Adds a ComboBoxEx control.
ja: MyGui.Add("Custom", "ClassComboBoxEx32") ; コントロールにComboBoxEx を追加します。

source: MyGui.Add("Edit", "ys") ; Start a new column within this section.
ja: MyGui.Add("Edit","ys") ; このセクション内で新しいカラムを開始します。

source: MyGui.Add("Edit", "vFirstName ym") ; The ym option starts a new column of controls.
ja: MyGui.Add("Edit", "vFirstName ym") ; ymオプションは、コントロールの新しい列を開始します。

source: MyGui.Add("Edit", "vMyEdit r5") ; r5 means 5 rows tall.
ja: MyGui.Add("Edit", "vMyEdit r5") ; r5は5列の高さを意味します。

source: MyGui.Add("Edit", "w600") ; Add a fairly wide edit control at the top of the window.
ja: MyGui.Add("Edit", "w600") ; ウィンドウの上部にかなり広いエディットコントロールを追加します。

source: MyGui.Add("Text", "Section", "First Name:") ; Save this control's position and start a new section.
ja: MyGui.Add("Text", "Section", "First Name:") ; このコントロールの位置を保存し、新しいセクションを開始します。

source: MyGui.Add("Text", "section", "First Name:") ; Save this control's position and start a new section.
ja: MyGui.Add("Text","section", "First Name:") ; このコントロールの位置を保存し、新しいセクションを開始します。

source: MyGui.Opt("+AlwaysOnTop +Disabled -SysMenu +Owner") ; +Owner avoids a taskbar button.
ja: MyGui.Opt("+AlwaysOnTop +Disabled -SysMenu +Owner") ; +Ownerはタスクバーボタンを回避することができる。

source: MyGui.Opt("+AlwaysOnTop -Caption +ToolWindow") ; +ToolWindow avoids a taskbar button and an alt-tab menu item.
ja: MyGui.Opt("+AlwaysOnTop -Caption +ToolWindow") ; +ToolWindowは、タスクバーボタンとalt-tabメニュー項目を回避します。

source: MyGui.Opt("+Disabled") ; Disable main window.
ja: MyGui.Opt("+Disabled") ; メインウィンドウを無効にします。

source: MyGui.Opt("+OwnDialogs") ; Force the user to dismiss the FileSelect dialog before returning to the main window.
ja: MyGui.Opt("+OwnDialogs") ; メインウィンドウに戻る前に、FileSelectダイアログを強制終了させる。

source: MyGui.Opt("+OwnDialogs") ; Forces user to dismiss the following dialog before using main window.
ja: MyGui.Opt("+OwnDialogs") ; メインウィンドウを使用する前に、以下のダイアログを強制的に解除させることができます。

source: MyGui.Opt("+Owner" OtherGui.Hwnd) ; Make the GUI owned by OtherGui.
ja: MyGui.Opt("+Owner" OtherGui.Hwnd) ; GUIをOtherGuiの所有にする。

source: MyGui.Opt("+Owner") ; Make the GUI owned by the script's main window to prevent display of a taskbar button.
ja: MyGui.Opt("+Owner") ; タスクバーボタンの表示を防ぐため、GUIをスクリプトのメインウィンドウに所有させる。

source: MyGui.Opt("-Disabled") ; Re-enable the main window (must be done prior to the next step).
ja: MyGui.Opt("-Disabled") ; メインウィンドウを再度有効にします（次のステップの前に行う必要があります）。

source: MyGui.SetFont("s32") ; Set a large font size (32-point).
ja: MyGui.SetFont("s32") ; 大きなフォントサイズ（32ポイント）を設定します。

source: MyGui.Show("NoActivate") ; NoActivate avoids deactivating the currently active window.
ja: MyGui.Show("NoActivate") ; NoActivateは、現在アクティブなウィンドウを非アクティブにすることを回避します。

source: MyGui.Show("x0 y400 NoActivate") ; NoActivate avoids deactivating the currently active window.
ja: MyGui.Show("x0 y400 NoActivate") ; NoActivateは、現在アクティブなウィンドウを非アクティブにすることを回避します。

source: MyGui.Show("xCenter y0 AutoSize") ; Resize the window to match the picture size.
ja: MyGui.Show("xCenter y0 AutoSize") ; 画像サイズに合わせてウィンドウをリサイズします。

source: MyGui.Show() ; Display the window.
ja: MyGui.Show() ; ウィンドウを表示します。

source: MyGui.Title := FileName ; Show file name in title bar.
ja: MyGui.Title := FileName ; タイトルバーにファイル名を表示します。

source: MyGui_Close(thisGui) { ; Declaring this parameter is optional.
ja: MyGui_Close(thisGui) { ; このパラメータの宣言は任意です。

source: MyMenu.Add ; Add a separator line.
ja: MyMenu.Add ; 区切り線を追加する。

source: MyMenu.Add ; Add a separator line below the submenu.
ja: MyMenu.Add ; サブメニューの下に区切り線を追加します。

source: MyMenu.Add "Item 3", MenuHandler ; Add another menu item beneath the submenu.
ja: MyMenu.Add "Item 3", MenuHandler ; サブメニューの下に別のメニューを追加します。

source: MyMenu.Add("Item 3", MenuHandler) ; Add another menu item beneath the submenu.
ja: MyMenu.Add("Item 3", MenuHandler) ; サブメニューの下に別のメニューを追加します。

source: MyMenu.Add() ; Add a separator line.
ja: MyMenu.Add() ; 区切り線を追加する。

source: MyMenu.Add() ; Add a separator line below the submenu.
ja: MyMenu.Add() ; サブメニューの下に区切り線を追加します。

source: MyPic.Value := Format("*w{1} *h{2} {3}", Width, Height, Image) ; Load the image.
ja: MyPic.Value := Format("*w{1} *h{2} {3}", Width, Height, Image) ; 画像を読み込みます。

source: MyText := MyGui.Add("Text", "wp") ; wp means "use width of previous".
ja: MyText := MyGui.Add("Text", "wp") ; wpは「前の幅を使え」という意味です。

source: MyVar := A_Index ; Initialize on first "use".
ja: MyVar := A_Index ; 初期化

source: N = NORMAL (this is valid only when used without any other attributes)
ja: N = NORMAL（他の属性を使用しない場合にのみ有効です）

source: N/A
ja: 該当なし

source: NIIF_USER (0x4) can also be used on its own for the small icon, but may not have consistent results across all OSes.
ja: NIIF_USER (0x4) は、小さなアイコンのために単独で使用することもできますが、すべてのOSで一貫した結果を得ることができない場合があります。

source: NO WARRANTY
ja: 保証なし

source: NOTE:
ja: 注：

source: NOTE: Some keys do not generate events and thus will not be visible here.
ja: 注：一部のキーはイベントが発生しないため、ここでは表示されません。

source: NOTE: The tooltip might never appear on certain OS versions.
ja: 注：OSのバージョンによってはツールチップが表示されない場合があります。

source: NTFS, FAT32, FAT, CDFS (typically indicates a CD), or UDF (typically indicates a DVD).
ja: はNTFS、FAT32、FAT、CDFS（通常はCDです。）、UDF（通常DVDです。）。

source: Name now requires 1 parameter to avoid confusion (match.Name throws an error).
ja: Nameは混乱を避けるため、1つのパラメータを必要とするようになりました（match.Nameはエラーを投げます）。

source: Name now requires one parameter to avoid confusion (match.Name throws an error).
ja: Nameは混乱を避けるため、1つのパラメータを必要とするようになりました（match.Nameはエラーを投げます）。

source: Name of the environment variable to use, e.g. "COMSPEC" or "PATH".
ja: 使用する環境変数名（例："COMSPEC"、"PATH"）。

source: Name of the currently retrieved item, which can be either a value name or the name of a subkey.
ja: 現在検索されている項目の名前。値名またはサブキーの名前のいずれかを指定します。

source: Name of the destination directory (with no trailing baskslash), which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 絶対パスが指定されていない場合、A_WorkingDirにあると仮定される宛先ディレクトリ名（末尾にバスクラッシュを付けない）。

source: Name of the directory to create, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 作成するディレクトリの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: Name of the directory to delete, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 削除するディレクトリの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: Name of the file that the shortcut refers to, which should include an absolute path unless the file is integrated with the system (e.g. Notepad.exe).
ja: ショートカットが参照するファイルの名前。そのファイルがシステムと統合されていない限り、絶対パスを含める必要があります（例：Notepad.exe）。

source: Name of the hotkey's activation key, including any modifier symbols.
ja: 修飾記号を含む、ホットキーの起動キーの名前。

source: Name of the shortcut file to be analyzed, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 解析するショートカットファイルの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: Name of the shortcut file to be created, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 作成するショートカットファイルの名前。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: Name of the source directory (with no trailing backslash), which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: ソースディレクトリの名前（末尾にバックスラッシュを付けない）。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: Named Function Hotkeys
ja: 名前付き機能ホットキー

source: Named Function Hotstrings
ja: 名前付き関数ホットストリング

source: Named Loops
ja: 名前付きループ

source: Named option "Horz".
ja: オプション名「Horz」。

source: Named option "Left".
ja: オプション名「Left」。

source: Named option "Multi".
ja: オプション名「Multi」。

source: Named option "Right" (default).
ja: オプション名「Right」（デフォルト）。

source: Named option "Wrap".
ja: オプション名「Wrap」。

source: Names
ja: 名称

source: Names and usage have been changed for several of the functions.
ja: 一部の機能については、名称および使用方法を変更しています。

source: Names cannot start with a digit and cannot contain the following characters which were previously allowed:
ja: 氏名は数字で始まることはできず、従来は認められていた以下の文字を含むことはできません：

source: Names cannot start with a digit and cannot contain the following characters which were previously allowed: @ # $.
ja: 氏名は数字で始まることはできず、従来は認められていた以下の文字を含むことはできません：@ # $。

source: Names of properties, methods and window groups are permitted to be reserved words.
ja: プロパティ名、メソッド名、ウィンドウグループ名には予約語を使用することができる。

source: Naming the function also encourages self-documenting hotkeys, like in the code above where the function name describes the hotkey.
ja: また、関数に名前を付けることで、上記のコードのように、関数名がホットキーを説明するような、ホットキーの自己文書化を促進します。

source: Naming the function also encourages self-documenting hotstrings, like in the code above where the function name describes the hotstring.
ja: また、関数に名前をつけることで、上のコードのように、関数名がホットストリングを説明するような、ホットストリングの自己文書化を促進します。

source: Native Exceptions and A_LastError
ja: ネイティブの例外とA_LastError

source: Navigating the Start Menu can be a hassle, especially if you have installed many programs over time.
ja: スタートメニューの操作は、特に長期にわたって多くのプログラムをインストールしている場合、面倒になることがあります。

source: Navy
ja: Navy（ネイビー）

source: Negates the default behavior for an edit control.
ja: エディットコントロールのデフォルトの動作を無効にする。

source: Negative values are allowed for the x and y coordinates to support multi-monitor systems and to allow a window to be moved entirely off screen.
ja: マルチモニターシステムをサポートし、ウィンドウを完全に画面外に移動できるようにするため、x座標とy座標には負の値が許される。

source: Negative values can be used to index in reverse.
ja: 負の値を使用すると、逆方向のインデックスを作成することができます。

source: Negative values count from the end of Haystack, so -1 is the last character, -2 is the second-last, and so on.
ja: 負の値はHaystackの最後から数えるので、-1が最後の文字、-2が2番目の文字のように指定します。。

source: Neither the VT_ARRAY nor the VT_BYREF flag can be set.
ja: VT_ARRAYフラグ、VT_BYREFフラグのいずれも設定できない。

source: Nested Classes
ja: 入れ子のクラス

source: Nested Functions
ja: ネストされた関数

source: Nested class definitions allow a class object to be associated with a static/class variable of the outer class instead of a separate global variable.
ja: 入れ子になったクラス定義では、クラス・オブジェクトを別のグローバル変数ではなく、外側のクラスの静的/クラス変数に関連付けることができます。

source: Nested class definitions now produce a dynamic property with get and call accessor functions instead of a simple value property.
ja: ネストされたクラス定義は、単純な値プロパティではなく、getおよびcallアクセッサ関数を持つ動的プロパティを生成するようになりました。

source: Nested functions can be declared static to prevent them from capturing non-static local variables of the outer function.
ja: ネストした関数は、外側の関数の非静的なローカル変数を取り込まないように、静的に宣言することができます。

source: Nested functions can be used instead, allowing full use of local variables.
ja: 代わりにネストされた関数を使用することで、ローカル変数を完全に使用することができます。

source: Nesting a class does not imply any particular relationship to the outer class.
ja: クラスを入れ子にすることは、外側のクラスとの特定の関係を意味するものではない。

source: New Directives
ja: 新しいディレクティブ

source: New Functions
ja: 新機能のご紹介

source: New Script
ja: 新しいスクリプト

source: New files are created with a UTF-16 byte order mark to ensure that the full range of Unicode characters can be used.
ja: 新しいファイルは、ユニコード文字の全範囲を使用できるように、UTF-16のバイト順マークで作成されます。

source: New methods:
ja: 新しい手法：

source: New methods: Get, Set, Clear
ja: 新しい手法：Get、Set、Clear

source: New properties:
ja: 新しいプロパティ：

source: New properties: Capacity, CaseSense
ja: 新しいプロパティ：Capacity、CaseSense

source: New script: Create a new script from a template.
ja: New script：テンプレートから新しいスクリプトを作成する。

source: New scripts should use {0} instead.":true
ja: New scripts should use {0} instead.":"非推奨。新しいスクリプトは代わりに {0} を使うべきである。"

source: New values for the flags identified by Mask, or flags to add or remove.
ja: Maskで識別されるフラグの新しい値、または追加または削除するフラグ。

source: Newline characters (`n) in expressions are treated as spaces.
ja: 式中の改行文字（`n）はスペースとして扱われます。

source: Next Steps
ja: 次のステップへ

source: Next Track
ja: 次のトラック

source: No meta-functions or property functions are called.
ja: メタファンクションや プロパティファンクションは呼び出されません。

source: No action is taken if the full source and destination paths are equal, as attempting to copy the file to its current location would result in an error.
ja: 完全なソースパスとデスティネーションパスが等しい場合、現在の場所にファイルをコピーしようとするとエラーになるため、何もしない。

source: No action is taken if the hotkey is already Off.
ja: ホットキーがすでにOffになっている場合は、何もしません。

source: No action is taken if the hotkey is already On.
ja: ホットキーがすでにOnになっている場合は、何もしません。

source: No blank components are allowed.
ja: ブランク部品は不可です。

source: No exception is thrown if a window is found but cannot be closed, so use WinExist or WinWaitClose if you need to determine for certain that a window has closed.
ja: ウィンドウが見つかっても閉じられない場合は例外がスローされないので、ウィンドウが閉じたかどうかを確実に判断する必要がある場合は、WinExistまたはWinWaitCloseを使用してください。

source: No exception was thrown within the try block.
ja: トライブロック内で例外は発生しませんでした。

source: No mechanisms are provided to list variables or set their values.
ja: 変数をリストアップしたり、その値を設定する仕組みは用意されていない。

source: No more than one {Alt up} is sent for this purpose for the lifetime of each script.
ja: このために送信される{Alt up}は、各スクリプトの有効期間中1回までである。

source: No special training or scripting experience is needed.
ja: 特別なトレーニングやスクリプトの経験は必要ありません。

source: Non-ASCII characters are represented by different binary values depending on the chosen encoding.
ja: 非ASCII文字は、選択したエンコーディングによって異なる2値で表現されます。

source: Non-auto-replace hotstrings will create a new thread when launched.
ja: 自動置換でないホットストリングは、起動時に新しいスレッドが作成されます。

source: Non-empty return values must be between -231 and 232-1 for 32-bit scripts (A_PtrSize = 4) and between -263 and 263-1 for 64-bit scripts (A_PtrSize = 8).
ja: 空でない戻り値は、32ビットスクリプトでは -231 から 232-1（A_PtrSize = 4）、64ビットスクリプトでは -263 から 263-1（A_PtrSize = 8）でなければなりません。

source: Non-icon images such as BMP, GIF and JPG may also be loaded.
ja: BMP、GIF、JPGなどの非アイコン画像も読み込むことができます。

source: Non-numeric components are compared alphabetically, and are case sensitive.
ja: 数値以外の成分はアルファベット順に比較され、大文字と小文字は区別されます。

source: Non-numeric components are compared alphabetically, and are case-sensitive.
ja: 数値以外の要素はアルファベット順に比較され、大文字と小文字が区別されます。

source: Non-static local variables of the outer function cannot be accessed dynamically unless they have been captured.
ja: 外側の関数の非静的なローカル変数は、キャプチャしない限り動的にアクセスすることはできません。

source: None of the other functions set ErrorLevel.
ja: 他のどの関数もErrorLevelを設定しません。

source: Nonexistent backreferences and those that did not match anything in Haystack -- such as one of the subpatterns in (abc)|(xyz) -- are transcribed as empty strings.
ja: 存在しない後方参照や、Haystackで何もマッチしなかったもの(abc)|(xyz)のサブパターンの1つなど）は、空文字列として書き出されます。

source: Nonexistent hotkey variant (IfWin).
ja: 存在しないホットキーバリアント（IfWin）。

source: Nonexistent hotkey.
ja: ホットキーが存在しない。

source: Nonzero if Input Method Manager/Input Method Editor features are enabled; zero otherwise.
ja: 入力メソッドマネージャ/入力メソッドエディタ機能が有効な場合は非ゼロ、そうでない場合はゼロ。

source: Nonzero if User32.dll supports DBCS; zero otherwise.
ja: User32.dllがDBCSをサポートしている場合は非ゼロ、そうでない場合はゼロ。

source: Nonzero if a mouse is installed; zero otherwise.
ja: マウスがインストールされていれば0以外、そうでなければ0。

source: Nonzero if a mouse with a wheel is installed; zero otherwise.
ja: ホイール付きマウスがインストールされていれば0以外、そうでなければ0。

source: Nonzero if all the display monitors have the same color format, zero otherwise.
ja: すべてのディスプレイモニターのカラーフォーマットが同じであれば0以外、そうでなければ0。

source: Nonzero if drop-down menus are right-aligned with the corresponding menu-bar item; zero if the menus are left-aligned.
ja: ドロップダウンメニューが対応するメニューバーアイテムと右揃えの場合はゼロ以外、左揃えの場合はゼロ。

source: Nonzero if security is present; zero otherwise.
ja: セキュリティがある場合はゼロ以外、ない場合はゼロ。

source: Nonzero if the Microsoft Windows for Pen computing extensions are installed; zero otherwise.
ja: Microsoft Windows for Pen コンピューティング拡張がインストールされている場合は非ゼロ、そうでない場合はゼロ。

source: Nonzero if the current session is shutting down; zero otherwise.
ja: 現在のセッションがシャットダウンされる場合は非ゼロ、そうでない場合はゼロ。

source: Nonzero if the debug version of User.exe is installed; zero otherwise.
ja: User.exeのデバッグバージョンがインストールされている場合は0以外、そうでない場合は0。

source: Nonzero if the meanings of the left and right mouse buttons are swapped; zero otherwise.
ja: マウスの左ボタンと右ボタンの意味が入れ替わる場合は非ゼロ、そうでない場合はゼロ。

source: Nonzero if the system is enabled for Hebrew and Arabic languages, zero if not.
ja: システムがヘブライ語とアラビア語で有効な場合はゼロ以外、有効でない場合はゼロ。

source: Nonzero if the user requires an application to present information visually in situations where it would otherwise present the information only in audible form; zero otherwise.
ja: そうでなければ音声のみで情報を提示するような状況で、ユーザがアプリケーションに視覚的な情報提示を要求している場合は0以外、そうでない場合は0。

source: Normal (or N)
ja: Normal（またはN）

source: Normal variable references are never enclosed in percent signs (except with #Include and #DllLoad).
ja: 通常の変数参照はパーセント記号で囲むことはありません（#Includeと #DllLoadを除きます）。

source: Normally if AutoHotkey is installed, right-clicking an AutoHotkey script (.ahk) file should give the following options:
ja: 通常、AutoHotkeyがインストールされている場合、AutoHotkeyスクリプト（.ahk）ファイルを右クリックすると、以下のオプションが表示されるはずです：

source: Normally shortcut key combinations consist of optional prefix/modifier keys (Ctrl, Alt, Shift and LWin/RWin) and a single suffix key.
ja: 通常、ショートカットキーの組み合わせは、任意のプレフィックス/モディファイアキー（Ctrl、Alt、Shift、LWin/RWin）と1つのサフィックスキーで構成されます。

source: Normally statements are executed sequentially from top to bottom, but a control flow statement can override this, such as by specifying that statements should be executed repeatedly, or only if a certain condition is met.
ja: 通常、文は上から下へ順番に実行されますが、制御フロー文では、文が繰り返し実行されたり、ある条件が満たされた場合にのみ実行されるように指定するなど、これを上書きすることができます。

source: Normally the primary mouse button (LButton) is on the left, but the user may swap the buttons via system settings.
ja: 通常、マウスのプライマリボタン（LButton）は左側にありますが、ユーザーはシステム設定によってボタンを入れ替えることができます。

source: Normally, GroupDeactivate is assigned to a hotkey so that this window-traversal behavior is automated by pressing that key.
ja: 通常、GroupDeactivateはホットキーに割り当てられており、そのキーを押すことでウィンドウ遷移の動作が自動化されるようになっています。

source: Normally, Send assumes that any modifier keys you are physically holding down should not be combined with the keys you are asking it to send.
ja: 通常、Sendは、物理的に押している修飾キーが、送信を要求しているキーと組み合わされてはいけないと仮定しています。

source: Normally, a window can only be dragged by clicking on its title bar.
ja: 通常、ウィンドウはタイトルバーをクリックすることでのみドラッグできる。

source: Normally, it is assigned to a hotkey so that this window-traversal behavior is automated by pressing that key.
ja: 通常は、ホットキーに割り当てられており、そのキーを押すことでこのウィンドウ遷移の動作が自動化されるようになっています。

source: Normally, the user's input is blocked (hidden from the system).
ja: 通常、ユーザーの入力はブロックされます（システムから隠されます）。

source: Normally, the windows API function RegisterHotkey() is used to implement a keyboard hotkey whenever possible.
ja: 通常、キーボードのホットキーを実装するには、可能な限りwindows API関数 RegisterHotkey()が使用されます。

source: Not Commonly Used
ja: 一般的ではない

source: Not Control Flow
ja: 非制御

source: Not all applications obey a ClickCount higher than 1 for turning the mouse wheel.
ja: すべてのアプリケーションが、マウスホイールの回転に対して1以上のClickCountを指定するわけではありません。

source: Not all expressions can be used alone on a line.
ja: すべての表現が行内で単独で使用できるわけではありません。

source: Not all games allow AHK to send keys and clicks or receive pixel colors.
ja: すべてのゲームでAHKがキーやクリックを送信したり、ピクセルカラーを受信したりできるわけではありません。

source: Not indented:
ja: インデントされていない：

source: Not only is bypassing these systems in violation of the games policies and could get you banned, they are complex to work around.
ja: これらのシステムを迂回することは、ゲームポリシーに違反し、あなたが追放される可能性があるだけでなく、回避するのが複雑です。

source: Not recommended.
ja: 推奨されません。

source: Not supported:
ja: 非対応：

source: Not supported: Hotkey, Slider, Tab and Link.
ja: 非対応：Hotkey、Slider、Tab および Link。

source: Not typically called by script; allows for-loops to be used with SafeArrays.
ja: SafeArraysでfor-loopを使用することができます。

source: Not yet supported.
ja: 未対応。

source: Note
ja: 摘要

source: Note that SplitPath can also be used for this, which is more reliable.
ja: なお、SplitPathを使用することも可能で、そちらの方がより確実です。

source: Note that hotkey prefix symbols such as ^ (control) and + (shift) are not supported (though GetKeyState can be used as a substitute).
ja: なお、^（control）、+（shift）などのホットキー接頭記号はサポートしていません（GetKeyStateで代替できます）。

source: Note that File.Seek, File.Pos and File.Length should not be used if Filename is a handle to a nonseeking device such as a pipe or a communications device.
ja: なお、Filenameがパイプや通信機器などの非シーキングデバイスへのハンドルである場合は、File.Seek、File.Pos、File.Lengthは使用しないこと。

source: Note that Seek, Pos and Length should not be used if Filename is a handle to a nonseeking device such as a pipe or a communications device.
ja: なお、Filenameがパイプや通信機器などの非シーキングデバイスへのハンドルである場合は、Seek、Pos、Lengthは使用しないこと。

source: Note that Text, Pic, MonthCal, UpDown and StatusBar controls do not accept the keyboard focus.
ja: なお、Text、Pic、MonthCal、UpDown、StatusBarコントロールは、キーボードフォーカスを受け付けません。
